#+TITLE: Etl_asn_company_table
Goal get most definitive Company ASN match from:
https://bgp.potaroo.net/cidr/autnums.html

** Suggestion from zz is to use the beautiful soup library from python
I am going to work through https://zetcode.com/python/beautifulsoup/#:~:text=BeautifulSoup%20is%20a%20Python%20library,%2C%20navigable%20string%2C%20or%20comment.
I will work in the autonums dir

#+BEGIN_SRC tmate :window autonums :dir (concat (getenv "HOME") "/autonums")
sudo pip3 install lxml
#+END_SRC
#+BEGIN_SRC tmate :window autonums :dir (concat (getenv "HOME") "/autonums")
sudo pip3 install bs4
#+END_SRC
#+BEGIN_SRC tmate :window autonums :dir (concat (getenv "HOME") "/autonums")
cat autnums.html | head
#+END_SRC

#+BEGIN_SRC python tmate :window python
#print('Please wait')
return 'A line of text.\n'
#+END_SRC

#+RESULTS:
#+begin_example
/home/ii/ii/org/research
#+end_example
** Export and upload to gbucket

#+begin_src sql-mode
\copy (select * from asnproc) to '~/peeringdb_company_asn.csv' csv header;
#+end_src

#+RESULTS:
#+begin_SRC example
COPY 181219
#+end_SRC
Login to gcloud
#+BEGIN_SRC tmate :window prepare
gcloud auth login
#+END_SRC

Set the project
#+BEGIN_SRC tmate :window prepare
gcloud config set project k8s-infra-ii-sandbox
#+END_SRC

#+BEGIN_SRC shell :results silent
gsutil cp ~/peeringdb_company_asn.csv gs://ii_bq_scratch_dump/peeringdb_company_asn.csv
#+END_SRC
#+BEGIN_SRC shell
gsutil ls gs://ii_bq_scratch_dump/
#+END_SRC

#+RESULTS:
#+begin_example
gs://ii_bq_scratch_dump/asn-data.csv
gs://ii_bq_scratch_dump/haha.csv
gs://ii_bq_scratch_dump/haha.json
gs://ii_bq_scratch_dump/image-tag-hash.csv
gs://ii_bq_scratch_dump/ip-and-asn.json
gs://ii_bq_scratch_dump/peeringdb-dump-20210512.sql
gs://ii_bq_scratch_dump/peeringdb-dump-20210603.sql
gs://ii_bq_scratch_dump/peeringdb_company_asn.csv
gs://ii_bq_scratch_dump/resource_and_hash_distinct_list.json
#+end_example
